/*
5. Королевство Нейтрония, где денежной единицей служит тварп, 
использует следующую шкалу налогообложения:
первые 5 000 тварпов – налог 0%
следующие 10 000 тварпов – налог 10%
следующие 20 000 тварпов – налог 15%
свыше 35 000 тварпов – налог 20%
Например, если некто зарабатывает 38 000 тварпов, то он должен заплатить 
налогов 5000 × 0,00 + 10000 × 0,10 + 20000 × 0,15 + 3000 × 0,20, или 4 600 тварпов.
Напишите программу, которая использует цикл для запроса доходов и 
выдачи подлежащего к выплате налога. Цикл должен завершаться, 
когда пользователь вводит отрицательное или нечисловое значение.
*/
#include <iostream>
using namespace std;
double calculate_tax (double income)
{
    double tax = 0.0;
    if (income > 35000){
        tax = 10000 * 0.1 + 20000 * 0.15 + (income - 35000) * 0.20;
    }
    else if (income > 15000 && income <= 35000){
        tax = 10000 * 0.1 + (income - 15000) * 0.15;
    }
    else if (income > 5000 && income <= 15000){
        tax = (income - 5000) * 0.10;
    }
    else if (income <= 5000){
        tax = 0.0;
    }
    return tax;
}

int main()
{
    double money;
    cout << "Сколько вы зарабатываете в тварпах: ";
    while (cin >> money && money > 0)
    {
        double tax = calculate_tax(money);
        cout << "Налог: " << tax << " тварпов\n";
        cout << "Сколько вы зарабатываете в тварпах: ";
    }  
    cout << "Done!\n";
    return 0;
}